{"data":{"partners":{"title":"Johan DahlÉn","image":"/uploads/johan.jpg","path":"/partners/johan-dahl-en","mail":"mailto:johan.dahlen@altacp.com","linkedin":"https://www.linkedin.com/in/johan-dahlen-823a13b/","position":"Founding Partner","content":"<h4 id=\"biography\"><a href=\"#biography\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Biography</h4>\n<p>Johan Dahlén is a Managing Director of Alta Capital Partners and has significant investment banking experience in domestic and international M&#x26;A as well as equity and debt financings. He has advised clients in emerging and developed markets in several industries including industrials, chemicals, alternative energy, telecom, technology, and consumer/retail.</p>\n<p>Prior to Alta, Johan worked at Morgan Stanley, UBS Investment Bank, and Jefferies, where most recently he was the senior coverage officer focused on industrial technology covering clients including General Electric, United Technologies, Eaton, TE Connectivity, Sensata, Amphenol, ABB, and Schneider Electric.</p>\n<p>Over his career, Johan has executed M&#x26;A transactions totaling over $23 billion. Notable M&#x26;A deals include GE Advanced Materials/Apollo, Telia’s Tess/Telecom Americas, SBC’s Ameritech New Media/Wide Open West, Bestfoods/Arisco, BBVA/Bancomer, International Paper/WY Containerboard, Stora Enso NA/Newpage, and Anchor Glass/Ardagh.</p>\n<p>Additionally, Johan has executed financings that have raised over $13 billion. Notable transactions include a private placement for Eclipse Aviation; initial public offerings for Embraer and Petrotec; and debt financings for Federative Republic of Brazil, International Paper, and NewPage.</p>\n<p>Johan received both his Bachelor of Science and Master of Science degrees in economics from the Stockholm School of Economics. He is fluent in Swedish and Portuguese, conversant in Spanish, and has lived in Sweden and Brazil.</p>\n","experience_1":"Morgan Stanley","experience_2":"UBS Investment Bank","experience_3":"Jefferies","id":"25bf38897d3ab94d9cc90c592088d5f3"}},"context":{}}