{"data":{"frontpage":{"the_firm":{"heading":"The Firm","text":"Alta Capital Partners is a leading boutique advisory firm providing best-in-class investment banking services to middle market clients around the world.<br/><br/>Our principals bring the know-how and expertise of the world’s most successful investment banks to an independent, client-focused platform, offering first-tier experience and tailored solutions to mergers, acquisitions, and financings.<br/><br/>Our strategic clients and longstanding relationships across the globe include early-stage entrepreneurs, family-owned businesses, established middle-market companies, and leading multinationals.<br/><br/>We have an extensive network of domestic and international financial partners comprised of family offices, venture capital and private equity funds, as well as traditional and alternative debt providers.","image":"/uploads/simple_world_maps.jpg"},"approach":{"heading":"Approach","text":"We provide our clients with truly exceptional service and dedication by having our senior bankers involved on a daily basis in each transaction. This commitment throughout the course of each transaction allows us to have a demonstrable impact on results while building trust and long-term relationships with our clients.<br/><br/>Our white glove service allows us to guide our clients through each transaction, preempting certain issues while proactively addressing others, which fosters our clients' confidence and optimizes outcomes.<br/><br/>We take seriously the trust each client places in us and work together with each client to develop a customized, strategic plan for success.","image":"/uploads/approach-image.png"},"section_image_one":{"heading":"Client-Driven Perspective","cover_image":"/uploads/ny-sky-2.jpg","text":"","layout":"style-1"},"section_image_two":{"heading":"Worldwide Trusted Advisors","cover_image":"/uploads/tony-bertolino-28801-unsplash-3.jpg","text":"","layout":"style-1"},"section_image_three":{"heading":"CORPORATE SOCIAL RESPONSIBILITY","text":"We are determined to make a positive impact on the planet and are supporting the aim of the Paris Agreement to limit the global temperature rise in order to substantially reduce the effects of climate change.<br/><br/>In taking action, we have calculated the climate footprint from our operations and are offsetting those emissions by providing ongoing support to renewable energy programs. <br/><br/>Alta Capital Partners is a supporter of the United Nation's Climate Change program.","cover_image":"/uploads/imagesection-three.jpg","layout":"style-2"}}},"context":{}}