{"data":{"partners":{"title":"Mark Tashkovich","image":"/uploads/mark.jpg","path":"/partners/mark-tashkovich","mail":"mailto:mark.tashkovich@altacp.com","linkedin":"https://www.linkedin.com/in/mark-tashkovich-965241/","position":"Founding Partner","content":"<h4 id=\"biography\"><a href=\"#biography\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Biography</h4>\n<p>Mark Tashkovich is the CEO and a Managing Director of Alta Capital Partners and has significant experience advising on domestic and cross-border M&#x26;A, equity, and debt transactions in the consumer/retail, industrial, healthcare, telecom, technology, and alternative energy sectors.  </p>\n<p>Prior to Alta, Mark served as the CEO of Ashir Capital, a 75-person, New York-based, China-focused investment bank with offices in Beijing, Guangzhou, and Hong Kong.  In that role, Mark led global strategy and operations and oversaw origination and execution of the firm’s transactions. </p>\n<p>Mark previously served as a senior coverage officer in the Global Consumer Products &#x26; Retail Group at UBS Investment Bank. In that role, Mark built UBS's investment banking franchise in several specialty retail subsectors and coordinated global coverage with teams in Asia, Europe, and Latin America. </p>\n<p>Before that, Mark worked in Equity Capital Markets at UBS and Morgan Stanley. During those years, Mark helped lead the execution of over 100 equity, equity-linked, and high yield financings, raising over $30 billion.  At Morgan Stanley, Mark also partnered in originating, structuring, and syndicating acquisition financings and bridges for over $22 billion. </p>\n<p>Prior to Morgan Stanley, Mark served as a corporate attorney at Weil, Gotshal &#x26; Manges, and clerked for the Chief Judge of the Federal District Court of Hawaii. </p>\n<p>Mark holds a JD from the University of Pennsylvania, where he was elected Articles Editor of the Law Review, an MPhil from the University of Cambridge, and a BA cum laude from Cornell University.</p>\n<p>Additionally, Mark serves as a strategic advisor to American Ballet Theatre and as a board member for the Sorensen Center for International Peace and Justice.</p>\n","experience_1":"Morgan Stanley","experience_2":"UBS Investment Bank","experience_3":"Ashir Capital","id":"2f99567bd41fd142d4fda856f1a4bb3c"}},"context":{}}